---
kind: property
id: P:Autodesk.Revit.DB.ElementCategoryFilter.CategoryId
source: html/d68724ed-ae1e-3c6e-89d0-3e4280f745e5.htm
---
# Autodesk.Revit.DB.ElementCategoryFilter.CategoryId Property

The category id.

## Syntax (C#)
```csharp
public ElementId CategoryId { get; }
```